app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 5]]
---

        <% @profile_owner.commented_posts.distinct.each do |post| %>

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 5]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 6]]
---

        <% if @profile_owner.posts.count >= 1 %>

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 6]]
---
            Here are <%= @profile_owner.name %>'s posts
            <%@profile_owner.posts.each do |post| %>

SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 5]]
---

        <% if !current_user.posts.count == 0 %>