app/views/posts/all.erb

    <% if user.name %>
        <p><%= link_to user.name.upcase, user_path(user) %>'s posts count : <%= user.posts.count %></p>
        <% user.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" INNER JOIN "post_comments" ON "posts"."id" = "post_comments"."post_id" WHERE "post_comments"."user_id" = ?  [["user_id", 2]]
SELECT COUNT(*) FROM "posts" INNER JOIN "post_comments" ON "posts"."id" = "post_comments"."post_id" WHERE "post_comments"."user_id" = ?  [["user_id", 3]]
SELECT "posts".* FROM "posts" INNER JOIN "post_comments" ON "posts"."id" = "post_comments"."post_id" WHERE "post_comments"."user_id" = ?  [["user_id", 3]]

    <% else  %>
        <p><%= link_to user.email.upcase, user_path(user) %>'s posts count : <%= user.posts.count %></p>
        <% user.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" INNER JOIN "post_comments" ON "posts"."id" = "post_comments"."post_id" WHERE "post_comments"."user_id" = ?  [["user_id", 2]]
SELECT COUNT(*) FROM "posts" INNER JOIN "post_comments" ON "posts"."id" = "post_comments"."post_id" WHERE "post_comments"."user_id" = ?  [["user_id", 2]]