app/views/posts/show.html.erb


<% if @post.post_comments.count == 0 %>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 36]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 36]]


    <% @post.post_comments.each do |comment| %>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 39]]