app/controllers/omniauth_controller.rb

    def github
        @user=User.create_from_provider_data(request.env['omniauth.auth'])
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "provider", "uid") VALUES (?, ?, ?, ?, ?, ?)

    def google_oauth2
        @user=User.create_from_provider_data(request.env['omniauth.auth'])
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "provider", "uid") VALUES (?, ?, ?, ?, ?, ?)