app/controllers/posts_controller.rb

  def show

    # @user=User.find(params[:user_id])
    @post=Post.find(params[:id])
    if User.find(params[:user_id])== @post.user
---
SELECT "users"."id" FROM "users" INNER JOIN "post_comments" ON "users"."id" = "post_comments"."user_id" WHERE "post_comments"."post_id" = ?  [["post_id", 18]]