app/controllers/post_comments_controller.rb

  def new

    @post=Post.find_by_id(params[:format])
    @post_owner=User.find_by_id(@post.users.ids.first)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT "users"."id" FROM "users" INNER JOIN "post_comments" ON "users"."id" = "post_comments"."user_id" WHERE "post_comments"."post_id" = ?  [["post_id", 17]]

  def create

    @post=Post.find(params[:post_comment][:post_id])
    @post_owner=User.find_by_id(@post.users.ids.first)
    # @commenter=current_user

    @post_comment= current_user.post_comments.build(post_comment_params)
    # @commenter.post_comments << @post_comment

    @post_comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 39], ["LIMIT", 1]]
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ? LIMIT ?  [["post_id", 47], ["LIMIT", 11]]
SELECT "users"."id" FROM "users" INNER JOIN "post_comments" ON "users"."id" = "post_comments"."user_id" WHERE "post_comments"."post_id" = ?  [["post_id", 22]]
INSERT INTO "post_comments" ("username", "body", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["username", "BEN"], ["body", "TSTTEST"], ["user_id", 6], ["post_id", 30], ["created_at", "2020-06-02 16:51:12.704700"], ["updated_at", "2020-06-02 16:51:12.704700"]]

  def show

    @commenter= current_user
    @comment= PostComment.find(params[:id])
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."id" = ? LIMIT ?  [["id", 49], ["LIMIT", 1]]

  def edit

    @comment= PostComment.find_by_id(params[:id])
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."id" = ? LIMIT ?  [["id", 62], ["LIMIT", 1]]

  def update

    @comment= PostComment.find(params[:id])

    @updated_username=params[:post_comment][:username]
    @updated_body=params[:post_comment][:body]
    if @comment.update(:username=> @updated_username, :body=>@updated_body)
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."id" = ? LIMIT ?  [["id", 62], ["LIMIT", 1]]
UPDATE "post_comments" SET "username" = ?, "body" = ?, "updated_at" = ? WHERE "post_comments"."id" = ?  [["username", "blaze"], ["body", "humidity tho"], ["updated_at", "2020-06-03 06:27:54.455337"], ["id", 62]]

  def destroy

    @comment=PostComment.find(params[:id])
    @comment_owner=@comment.user
    @comment_post=@comment.post
    @comment.destroy
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."id" = ? LIMIT ?  [["id", 75], ["LIMIT", 1]]
DELETE FROM "post_comments" WHERE "post_comments"."id" = ?  [["id", 75]]