app/controllers/post_comments_controller.rb

  def create


    @post=Post.find(params[:post_comment][:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]