app/controllers/posts_controller.rb

  def index

    @user=User.find(params[:user_id])
    @posts=@user.posts.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" INNER JOIN "post_comments" ON "posts"."id" = "post_comments"."post_id" WHERE "post_comments"."user_id" = ? ORDER BY "posts"."id" ASC LIMIT ?  [["user_id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create

    @user=User.find(params[:user_id])
    @post=@user.posts.create(post_params)
    if !@post.content.nil?
      @post.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "FIRE! [BLAZE]"], ["created_at", "2020-06-03 17:31:13.685773"], ["updated_at", "2020-06-03 17:31:13.685773"], ["user_id", 5]]
INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "Looks like Hand Sanitizers are back!  I got one today! [BLAZE]"], ["created_at", "2020-06-03 15:15:13.605674"], ["updated_at", "2020-06-03 15:15:13.605674"]]

  def show

    @user=User.find(params[:user_id])
    @post=Post.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 48], ["LIMIT", 1]]

  def edit
    @post=Post.find(params[:id])
    @user=User.find(params[:user_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 53], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def update
    @user=User.find(params[:user_id])
    @post=Post.find(params[:id])
    if @post.update(post_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 53], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "YAY! -[BLAZE]"], ["updated_at", "2020-06-03 16:30:01.972903"], ["id", 53]]

  def destroy

    @post=Post.find(params[:id])
    @user=User.find(params[:user_id])
    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 47], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 47]]

  def all
    @all_posts=Post.all
    @all_users=User.all
    @all_users_count=User.all.count
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"