app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "view" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["view", 1], ["updated_at", "2020-06-01 21:34:19.361046"], ["id", 4]]
---
  def show

    @user=User.find(params[:id])
    @users=User.all
    @profile_owner=@user
    @user_posts=@user.posts

    @views= @user.view

    if @user != current_user
      @updated_views=@views+1
      @user.update(:view=>@updated_views)

SELECT "users".* FROM "users" WHERE (view > 20) ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def famous_user
    @famous_user_ar_relation = User.famous_users
    @famous_user=User.find_by_id(@famous_user_ar_relation.first.id)